NewsReader/app/controllers/api/users_controller.rb

INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 03 Apr 2015 00:54:49 UTC +00:00], ["password", "haley"], ["updated_at", Fri, 03 Apr 2015 00:54:49 UTC +00:00], ["username", "haley"]]
---
  def create
    user = User.new(user_params)
    user.save!